In [1]:
## dataframe -> combination of one or more series

# Data frame

In [3]:
import pandas as pd 
import numpy as np

In [4]:
x = np.array([100,200,300,400])

In [5]:
y = pd.Series(x)

In [6]:
y

0    100
1    200
2    300
3    400
dtype: int64

In [7]:
pd.DataFrame(y) #two dimensional structure

     0
0  100
1  200
2  300
3  400

In [8]:
pd.DataFrame(y,index=[10,20,30,40],columns=[2])

     2
10 NaN
20 NaN
30 NaN
40 NaN

In [9]:
#Create dataframe from list

In [10]:
x = ["a","b","c"]

In [11]:
type(x)

list

In [12]:
pd.DataFrame(x)

   0
0  a
1  b
2  c

In [13]:
#List of data 
#A person's details -> name,age,contact

In [14]:
details =[["Riya",18,4254454],["Happie",20,4298454],["Finki",19,4256804]]

In [15]:
pd.DataFrame(details,index=[1,2,3],columns=["Name","Age","Contact no:"])

     Name  Age  Contact no:
1    Riya   18      4254454
2  Happie   20      4298454
3   Finki   19      4256804

In [16]:
#Create dataframe with dictionary

In [17]:
details1={"Name":["Riya","Frank","Dev","Tj"],"Age":[12,43,65,12]}

In [19]:
pd.DataFrame(details1,index=[1,2,3,4],columns=["Name","Age"])

    Name  Age
1   Riya   12
2  Frank   43
3    Dev   65
4     Tj   12

In [20]:
pd.DataFrame(details1,index=[1,2,3,4],columns=["Contact","Age"])

  Contact  Age
1     NaN   12
2     NaN   43
3     NaN   65
4     NaN   12

In [21]:
#for dictionary the key value is already defined but for list its we define it

In [22]:
#Numpy array dataframe

In [24]:
x = np.array([10,20,30,40])

In [28]:
pd.DataFrame(x,columns=["numbers"])

   numbers
0       10
1       20
2       30
3       40